---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBackDirn1
source: html/e39b12ce-1000-2a9f-e26a-67a8a130432c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeBackDirn1 Property

"Interior Major Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookTypeBackDirn1 { get; }
```